# AsValueString Method (FormatOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..AsValueString Method (FormatOptions)
Parameter Class See Also
---
Get the parameter value as a string with units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string AsValueString(
	FormatOptions formatOptions
)
```

Visual Basic
---
```text
Public Function AsValueString ( _
	formatOptions As FormatOptions _
) As String
```

Visual C++
---
```text
public:
String^ AsValueString(
	FormatOptions^ formatOptions
)
```

# ### Parameters
formatOptions
    Type: Autodesk.Revit.DB..::..FormatOptionsOptions for formatting the string.
# ### Return Value
The string that represents the parameter value.
# See Also
Parameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace